# Shells
brew "bash"
brew "zsh"

# System commands
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-sed"
brew "less"

# General commands
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "hexyl"
brew "ripgrep"
brew "sd"
brew "tree"
brew "zoxide"

# System utilities
brew "bottom"
brew "cpufetch"
brew "duf"
brew "fastfetch"
brew "htop"
brew "ncdu"
brew "procs"

# General utilities
brew "age"
brew "direnv"
brew "hyperfine"
brew "onefetch"
brew "pandoc"
brew "rename"
brew "task"
brew "tealdeer"

# Services
brew "koekeishiya/formulae/yabai"

# Media viewers
brew "chafa"

# Text editors
brew "nano"
brew "neovim"

# Web
brew "aria2"
brew "oha"
brew "openssh"
brew "qrcp"
brew "wget"
brew "xh"

# Development
brew "corepack"
brew "dotnet"
brew "node"
brew "openjdk"
brew "pipx"
brew "python"
brew "r"
brew "rust"

# Fonts
cask "font-sarasa-gothic"

# [ install_cask start ]
# Academics
cask "zotero"

# IDE
cask "pycharm"
cask "rider"
cask "visual-studio-code"
cask "webstorm"

# Media viewers
cask "iina"
cask "xnviewmp"

# Productivity
cask "karabiner-elements"
cask "raycast"

# Terminal
cask "wezterm"

# Utilities
cask "aldente"
cask "basictex"
cask "keka"
cask "shottr"
cask "xnconvert"

# Web browser
cask "google-chrome"
# [ install_cask end ]
